{
  "projects": [
    {
      "id": "planaki",
      "title": "Planaki",
      "description": "Planaki é o app social para criar eventos, compartilhar fotos, conversar em tempo real e organizar contribuições — coletivas ou individuais, públicas ou privadas — tudo para viver e guardar momentos especiais com amigos e família.",
      "longDescription": "Planaki é uma plataforma social inovadora que revoluciona a forma como as pessoas organizam e compartilham momentos especiais. Com foco na experiência do usuário e na facilidade de uso, o aplicativo permite criar eventos, compartilhar fotos em tempo real e gerenciar contribuições de forma intuitiva.\n\nA plataforma oferece recursos avançados de comunicação em tempo real, permitindo que grupos de amigos e família mantenham-se conectados e organizados durante eventos e celebrações. Com suporte para contribuições coletivas e individuais, o Planaki facilita o planejamento e a execução de eventos de todos os tipos.",
      "technologies": [
        "Expo",
        "React Native",
        "PostgreSQL",
        "NodeJs",
        "Socket.IO",
        "TypeScript"
      ],
      "features": [
        "Criação e gerenciamento de eventos",
        "Compartilhamento de fotos em tempo real",
        "Chat em tempo real com Socket.IO",
        "Sistema de contribuições coletivas e individuais",
        "Eventos públicos e privados",
        "Notificações em tempo real"
      ],
      "playStoreLink": "https://play.google.com/store/apps/details?id=com.nirmata.planaki",
      "terms": {
        "title": "Termos de Uso do Planaki",
        "sections": [
          {
            "title": "1. Aceitação dos Termos",
            "content": "Ao usar o Planaki, você concorda com estes termos de uso. O aplicativo é destinado a maiores de 13 anos."
          },
          {
            "title": "2. Uso do Serviço",
            "content": "O Planaki permite criar e gerenciar eventos, compartilhar fotos e gerenciar contribuições. Você é responsável por todo o conteúdo que compartilha."
          },
          {
            "title": "3. Privacidade",
            "content": "Coletamos informações necessárias para o funcionamento do app, incluindo dados de perfil, fotos e localização quando relevante para eventos."
          },
          {
            "title": "4. Segurança",
            "content": "Mantenha suas credenciais seguras e não compartilhe sua conta. Reporte qualquer uso não autorizado imediatamente."
          }
        ]
      },
      "privacy": {
        "title": "Política de Privacidade do Planaki",
        "sections": [
          {
            "title": "1. Dados Coletados",
            "content": "Coletamos informações de perfil, fotos, dados de eventos e localização quando necessário para funcionalidades específicas."
          },
          {
            "title": "2. Uso dos Dados",
            "content": "Seus dados são usados para fornecer e melhorar o serviço, personalizar sua experiência e manter a segurança da plataforma."
          },
          {
            "title": "3. Compartilhamento",
            "content": "Seus dados podem ser compartilhados com outros usuários conforme as configurações de privacidade que você escolher para cada evento."
          },
          {
            "title": "4. Seus Direitos",
            "content": "Você pode acessar, corrigir ou excluir seus dados a qualquer momento através das configurações do aplicativo."
          }
        ]
      }
    },
    {
      "id": "radii",
      "title": "Radii",
      "description": "Uma rede social baseada em proximidade geográfica que mostra pessoas próximas a você em tempo real. Mas aqui está a reviravolta: essas pessoas desaparecem da sua lista 'Próximos' em 24 horas, a menos que você tome uma ação.",
      "longDescription": "Radii é uma rede social inovadora que revoluciona a forma como as pessoas se conectam com base na proximidade geográfica. A plataforma utiliza tecnologia de localização em tempo real para mostrar pessoas próximas a você, criando oportunidades únicas de conexão e interação social.\n\nO diferencial do Radii está em seu mecanismo de expiração: as conexões têm um prazo de 24 horas para serem estabelecidas. Se você encontrar alguém interessante nas proximidades, precisa sincronizar com essa pessoa para mantê-la em sua rede. Isso incentiva interações mais significativas e decisões mais conscientes sobre suas conexões sociais.",
      "technologies": [
        "Expo",
        "React Native",
        "PostgreSQL",
        "NodeJs",
        "Socket.IO",
        "TypeScript",
        "Google Maps API"
      ],
      "features": [
        "Detecção de pessoas próximas em tempo real",
        "Sistema de expiração de conexões em 24 horas",
        "Mecanismo de sincronização para manter conexões",
        "Mapa interativo com visualização de proximidade",
        "Chat em tempo real com conexões estabelecidas",
        "Configurações personalizáveis de privacidade"
      ],
      "playStoreLink": "https://play.google.com/store/apps/details?id=com.nirmata.radii",
      "terms": {
        "title": "Termos de Uso do Radii",
        "sections": [
          {
            "title": "1. Aceitação dos Termos",
            "content": "Ao usar o Radii, você concorda com estes termos. O app requer permissão de localização para funcionar corretamente."
          },
          {
            "title": "2. Uso do Serviço",
            "content": "O Radii permite conectar-se com pessoas próximas. Você é responsável por suas interações e deve respeitar a privacidade dos outros."
          },
          {
            "title": "3. Localização",
            "content": "O app usa sua localização em tempo real. Você pode controlar quando compartilhar sua localização através das configurações."
          },
          {
            "title": "4. Segurança",
            "content": "Mantenha suas credenciais seguras e reporte qualquer comportamento suspeito. Não compartilhe informações sensíveis no chat."
          }
        ]
      },
      "privacy": {
        "title": "Política de Privacidade do Radii",
        "sections": [
          {
            "title": "1. Dados de Localização",
            "content": "Coletamos sua localização em tempo real para mostrar pessoas próximas. Os dados são excluídos após 24 horas se não houver conexão."
          },
          {
            "title": "2. Dados do Perfil",
            "content": "Seu perfil inclui informações básicas como nome e foto. Você controla quem pode ver essas informações."
          },
          {
            "title": "3. Compartilhamento",
            "content": "Sua localização é compartilhada apenas com usuários que você aprovar. Você pode revogar o acesso a qualquer momento."
          },
          {
            "title": "4. Seus Direitos",
            "content": "Você pode desativar o rastreamento de localização, excluir sua conta e solicitar uma cópia dos seus dados a qualquer momento."
          }
        ]
      }
    },
    {
      "id": "owani",
      "title": "Owani",
      "description": "Uma plataforma de real estate projetada para atender às necessidades específicas do mercado imobiliário de Moçambique. Conecta acompanhantes — profissionais que auxiliam em visitas a imóveis para alugar — com potenciais inquilinos e proprietários.",
      "longDescription": "O Owani é uma plataforma de real estate projetada para atender às necessidades específicas do mercado imobiliário de Moçambique. O foco principal é conectar acompanhantes — profissionais que auxiliam pessoas em visitas a imóveis para alugar — com potenciais inquilinos e proprietários.\n\nA plataforma permite que os acompanhantes cadastrem seu serviço, publiquem casas que conhecem e interajam diretamente com os interessados em alugar imóveis. Isso cria um ecossistema transparente e eficiente para quem busca moradias de aluguel e para quem oferece suporte nesse processo.",
      "technologies": [
        "Expo",
        "React Native",
        "Tailwindcss",
        "TypeScript",
        "NodeJs",
        "Prisma",
        "SQL"
      ],
      "features": [
        "Cadastro de acompanhantes",
        "Publicação de imóveis",
        "Sistema de agendamento de visitas",
        "Chat em tempo real",
        "Avaliações e reviews",
        "Sistema de pagamentos"
      ],
      "playStoreLink": "https://play.google.com/store/apps/details?id=com.nirmata.owani",
      "terms": {
        "title": "Termos de Uso do Owani",
        "sections": [
          {
            "title": "1. Aceitação dos Termos",
            "content": "Ao usar o Owani, você concorda com estes termos. O app é destinado a maiores de 18 anos."
          },
          {
            "title": "2. Uso do Serviço",
            "content": "O Owani conecta acompanhantes com inquilinos. Acompanhantes devem fornecer informações precisas sobre os imóveis."
          },
          {
            "title": "3. Pagamentos",
            "content": "As taxas de serviço são claramente informadas antes de cada transação. Reembolsos seguem nossa política específica."
          },
          {
            "title": "4. Responsabilidades",
            "content": "Acompanhantes são responsáveis pela veracidade das informações dos imóveis. Usuários devem respeitar os horários agendados."
          }
        ]
      },
      "privacy": {
        "title": "Política de Privacidade do Owani",
        "sections": [
          {
            "title": "1. Dados Coletados",
            "content": "Coletamos informações de perfil, dados de imóveis, histórico de visitas e informações de pagamento quando necessário."
          },
          {
            "title": "2. Uso dos Dados",
            "content": "Seus dados são usados para facilitar o processo de aluguel, processar pagamentos e melhorar o serviço."
          },
          {
            "title": "3. Compartilhamento",
            "content": "Informações de imóveis são compartilhadas publicamente. Dados pessoais são compartilhados apenas com partes envolvidas na transação."
          },
          {
            "title": "4. Seus Direitos",
            "content": "Você pode acessar, corrigir ou excluir seus dados, incluindo anúncios de imóveis, a qualquer momento."
          }
        ]
      }
    }
  ]
} 